programmingTutorial08/programmingTutorialV2406/testCase/003-heatSimpleFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;;
    object      T;
}	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 30;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 45;
    }

    outlet
    {
        type            zeroGradient;
    }
    Right
    {
        type            symmetryPlane;
    }

    wall
    {
        type            fixedValue;
        value           uniform 200;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
